let nepJokes = [
  `हाकु कालेले केटीलाई फोन गर्छ:\n
    हाकु : हाई डार्लिङ्!\n
    मैचा : हेलो डिएर!\n
    हाकु : के छ मैया, मलाई टिम्रो निकै याड आइरा’छ नि होई\n
    मैचा : लौ, अघि भर्खर मात्रै कुरा गरेको हैन भन्या फोनमा त्यत्रो बेरसम्म!\n
    हाकु : का बैमान, फेरि टिम्लाई नै परेछ!\n`,

  `जीग्री : रक्षा, तिमीसँग भेटे देखि रक्सी – चुरोट सबै खान छोड्ए!
    
    रक्षा : हामी बिचको मायाले गर्दा नखाको है?
    
    जीग्री : मायाले होईन, प्रिय, पैसाको अभावले हो!\n`,

  `रक्षा : सुन्दैछु जीग्री हिजो तिमी धेरै रक्सी खाएर ढलमा लड्यौ रे!
    
    जीग्री : अं, यो सब गलत संगतको परिणाम हो! ४ जना साथी १ बोतल रक्सी तर ३ जनै नखानेको संगत गर्नाले मैले धेरै खानुपर्यो ॥`,

  `राम : मानौं म मरे भने तिमी अर्कोसँग बिहे गरेर बस्छौ होला है?
    
    सिता : छ्या! के कुरा गर्या होला, गर्दिन अरूसँग बिहे। म त मेरै बहिनीसँग बस्छु। अनि बरु म मरे भने तिमी के गर्छौ नि?
    
    राम : म पनि तिम्रै बहिनीसँग बस्छु नी!`,
  `(हरि र राधा कारमा जादै थिए…)
    
    राधा : अनि हरि, आज हामी कहाँ जाँदैछौँ?
    
    हरि : लंग् ड्राइभमा नि!
    
    राधा : आहा! हो र, किन अगाडि नै न भनेको त?
    
    हरि : मैले पनि भर्खरै थाह पाएँ कि कारको ब्रेक फेल रैछ भनेर!`,
  `Girlfriend: हेल्लो, कहाँ हुनुहुन्छ।
    
    Boyfriend : मोटीवेट गर्दैछु।
    
    Girlfriend : लौ, कस्लाई motivate?
    
    Boyfriend : कसलाई रे? एक घण्टा देखि तिमीलाई Wait गर्दैछु नि, मोटी!`,
  `(हरि र रमा फोनमा बोल्दै)
    
    हरि : तिमी सार्है राम्री छौ।
    
    रमा : हो र जानु?
    
    हरि : तिमी एकदम परि जस्तै छौ!
    
    रमा : साँच्चै?
    
    हरि : अँ हो नी!
    
    रमा : (खुशी हुदै) अनि अहिले के गर्दै हुनुहुन्छ?
    
    हरि : मजाक`,
  `भक्त : प्रभु तपाईँको त्रिशुल खोइ त?
    
    महादेव : राजेश हमालले लगेको छ।
    
    भक्त : किन र प्रभु?
    
    महादेव : चाउमिन खान चाहियो रे क्या!`,
  `१२ को रिजलट आए पछि बाबु छोरीलाई सोध्धै
    
    बाबु : अब के गर्ने बिचार छ त छोरी तिम्रो?
    
    छोरी : BBA बुबा
    
    बुबा : के हो त्यो भनेको?
    
    छोरी : Boyfriendको Bikeमा Aish
    
    (अनि बुबा बेहोस!)`,
  `(पसले ले निक्कै बेर सागमा पानी छर्केको हेरेपछि)
    
    बले सोल्टी : साहु जी, त्यो सागलाई होस् आको भए मलाई १ किलो जोख्दिनुस् त सार्है हतार छ।`,
  `डाक्टर : लौ बरबाद, अपरेसन गरेको ठाउँको फेरि टाका खोल्नुपर्ने भो!
    
    पाण्डे : किन र डाक्टर साब?
    
    डाक्टर : मेरो एउटा पन्जा भित्रै छुटेछ!
    
    पाण्डे : डाक्टर सब पनि कति लोभी हुनु भा, पर्दैन टाका खोल्न जाबो एउटा पन्जाको लागि! लिनुस पैसा बरू नयाँ पन्जा किन्नुस्॥`,
  `प्रेम सम्बन्धको लागि १ थिच्नुहोस्, स्वयमवरको लागि २ थिच्नुहोस् र विवाहको लागि ३ थिच्नुहोस् ॥
    
    मुन्द्रे : अनि दोस्रो विवाहको लागि चै के थिच्ने?
    
    एनसेल : पहिलो पत्नीको घाटी थिच्नुहोस् ॥`,
  `दिपक : रवि, म त सधैं अफिस जानु अघि मेरो श्रीमतीलाई १ किस गरेर मात्र जान्छु। तँ नि?
    
    रबि : म पनि त्यही गर्छु, तँ अफिस गए पछि!`,
  `शिक्षक : तिम्रो र राजुको उत्तर एउटै थियो नी किन!
    
    विध्यार्थी : किनभने, प्रश्न पनि त एउटै थियो नी, सर!`,
  `बाउ:- एक पैसा को बुद्दी छैन तेरो ! धनियाको पत्ता लेराइज भनेको पुदिना लेरायर मरेछ । तं जस्तो नालायक बेकुफ घरमा बस्न भन्दा निस्केर गयको जाती हुन्छ
    
    सेरे:- तेसो भय संगै निस्के हुन्न र?
    
    बाउ;- तं संग म किन निस्किनी नि?
    
    सेरे:- आमाले त यो मेथिको साग हो भन्नू भाथ्यो |`,
  `#शिक्षिका : यस्तो चिजको नाम भन जुन तिमि देख्न सक्छौ तर छुन सक्दैनौ
    
    #विद्यार्थी : मिस तपाईको वुवु
    
    `,
  `कुशल कलर टि.भी. किन्न जान्छ.
    
    कुशल : के तपाईँकोमा कलर टि.भी. छ?
    
    पसले: छ।
    
    कुशल : मलाई रातो टि.भी. दिनु त`,
  `बाउ:नालायक, फेरी फेल भईस exam मा? छिमेकीको छोरीलाई हेर त,ऊ सधैं क्लासमा फस्ट हुन्छे।
    
    मुन्द्रे:Dad,अझै कति हेर्नु,उसैलाई हेरेर त यो हालत भो`,
  `पत्नी: मेरो जन्म दिवशमा चेनउपहार दिनुपर्छनी!! सुन्नुभो?
    
    पती: किन नसुन्नुनी, कती सुने कती। बरु भनन केको चेन दिउ मोटरसाइकल को कि साइकलको ?`,
  `बुढो लामखुट्टे:बाबु हाम्रो पालामा रगत चुस्न अहिले जस्तो सजिलो थिएनl
    
    नाती: किन हजुरबा?
    
    बुढो लामखुट्टे: उ बेला केटीहरु पुरै कपडा लगाउथे`,
  `डाक्टर:के समस्या छ भन्नुस् ?
    
    शेरे:छाती धेरै दुख्छ
    
    डाक्टर:चुरोट पिउनुहुन्छ?
    
    शेरे:हुन्छ मगाउनुस् न त तर सूर्य है, अरु चैँ त्यति मनपर्देन.`,
  `रोगी:’आई लव यु’ तिमीले मेरो मुटु चोरयौ।
    
    नर्स: (लजाउदैं) धत्त!! हामिले तिम्रो मुटुलाई हात पनि लगाएनौ ,हाम्ले त मात्र किड्नी झ्याप हानेको।`,
  `केटा – यदी मैले तीमीलाई कीस गरे भने तीमी के गर्छौ ?
    
    केटी –म सम्झन्छु एउटा बेवकुफ थीयो जो पुरा देश घुम्न सक्थियो तर एअरपोर्ट बाट नै फर्कीयो |`,
  `एउटा #कन्जुस को खुट्टामा काँटि विझेछ, त्यसपछी कन्जुसले मन मनै भनेछ,” खालि खुट्टा हिडेको नि ठिकै भएछ, झण्डै चप्पल प्वाल परेको |`,
  `केटा:कहाँ जादै छौ ?
    
    केटि:आत्मा हत्या गर्न
    
    केटा:अनि किन येति धरै makeup गरेको त ?
    
    केटि:थुक्क तेती पनि थाहा छैन भोलि समाचारमा फोटो आउछ तेसैले`,
  `श्रीमान श्रीमतीको झगडा भएछ,
    
    श्रीमान:फोनबाट, आज बेलुका खाना के छ
    
    श्रीमती: बिष
    
    श्रीमान:त्यसो भए तिमि खाएर सुत्नु म बाहिरै खाएर आउछु|`,
  `आज पत्रीकामा चूरोट सेवनगर्दा Hune असरहरु पढे, कस्तो नरमाइलो लाग्यो मन कटक्क दुखेर आयो, अनी मन मनै प्रण गरे, आज देखी कहिलै पत्रीका पढ्दिन |
    
    `,
  `छोरोःडेडी, पल्लो घरको अंकलको नाम डार्लिङ हो?
    
    बाबुःहैन बाबु रमेश हो ।
    
    छोराःअनि हजुर अफिस जानासाथ मम्मीले त त्यो अंकललाई डार्लिङ भन्नुहुन्छत.`,
  `ईन्स्पेक्टर सेरेसँग: तलाई फासी दिनुभन्दा अगाडि तेरो कुनै ईच्छा छ?
    
    सेरे: हजुरसर, मलाई टाउको तल खुट्टा माथि गरेर फासी दिनुहोला |`,
  `बुढी:तिम्लाइ म कस्तोलाग्छ?
    
    शेरे:साह्रै राम्री.
    
    बुढी:कत्तिको राम्री?अलिक खुलेर भनन.
    
    शेरे:यतीकि तिमी जस्तो अझैअरु २/३ ल्याऊकि भनेर सोच्दैपो छु`,
  `भारतबाट नेपाल आइरहेको यात्रुबाहक बस र साइकल ठोक्किँदा बसमा भएका सबै जनाको मृत्यु भएको छ। साइकल चालक राजेशहमाल चाहिँ फरार छन्।`,
  `पुलिस : तैले किन यति धेरै पिएको ?
    
    जड्याहा : बाध्यता थियो साव।
    
    पुलिस : के बाध्यता थियो?
    
    जड्याहा : बोतलको बिर्कै हराएपछी म के गर्ने त साब|`,
  `मोदी:-समुन्द्रको बिचमा आँप फल्यो कसरी टिप्ने?
    
    ओली:-चरा जसरी उडेर.
    
    मोदी:-तिम्रो बाउ उड्छ चरा जसरी?
    
    ओली:-तिम्रो बाउले उमार्छ समुन्द्रमा`,
  `ग्राहक रिसाउँदै करायो मेरो सुपमा त ज्युँदो झिँगा छ नि
    
    चिन्ता नलिनुस् हजुर सुप एकदम तातो छ त्यो झिँगा एकैछिन्मा मर्छ वेटरले उत्तर दियो .`,
  `छोराको सर्टफिकेट हेर्दै बाउ ले भनेछ: तेत् यती थोरै मार्कस् कुटाई नपुगेको
    
    छिरो: हो ड्याड, जाम कुट्न। मैले त्यो सर को घर देखेको छु!`,
  `एक साथी-तैले अग्लो केटीसँग विवाह किन गरेको?
    
    अर्को साथी- ता कि म पत्नीसँग शीर उठाएर कुरा गर्न सकौँ।`,
  `खरायो धेरै कुद्छ 5/6 साल बाच्छ कछुबा कुद्दैन 100/200 साल बाच्छ त्यसैले साथीहो बीहान उठेर कुद्ने काम नगरुम 8 बजेसम्म सुतुम…haha`,
  `चाहे भने केटीले तपाइलाइ लख पती बनाउन सक्छन… तर तेस्का लाइ तपाइ करोड पती हुन जरुरी छ.`,
  `एक दिन बाबू र छोरा रेष्टुरेन्टमा खाजा खान गए छ: बाबू: वेटर एउटा आइसक्रीम र एउटा बियर लेउ त छोरा: आइसक्रीम किन डयडी, तपाईं पनि बियर नै खानुस।
    
    `,
  `एक पण्डित बाजेलाई झाडा पखालाले च्यापेछ.
    
    डाक्टरलाई सोधेछन्..”के के कुरामा ध्यान दिन पर्ला डाक्टर साव ?
    
    डाक्टरः “जोडले शंख नफुक्नु होला..`,
];
let bt = document.getElementById("next_joke_button_nepali");
const GetRandomJokes = () => {
  let indexx = parseInt(Math.random() * (nepJokes.length - 1) + 1);
  joke_text.innerHTML = nepJokes[indexx];
};
bt.addEventListener("click", GetRandomJokes);
